Hi @shoekstra. The cause of the issue here is calling a function with a known argument (as `data.archive_file.default.output_path` is specified by your configuration) which is then immediately evaluated, before the data source is refreshed.

Aside from the `-target` workaround you already found, I think the easiest solution here would be to directly use [the `output_base64sha256` attribute of the data source](https://registry.terraform.io/providers/hashicorp/archive/latest/docs/data-sources/archive_file#attributes-reference) instead of calling `filebase64sha256`. That is:

```terraform
resource "null_resource" "default" {
  triggers = {
    hash = data.archive_file.default.output_base64sha256,
  }
}
```

This then plans and applies correctly:

```shellsession
$ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.default will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "default"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/Users/alisdair/Desktop/repro/30042/dummy.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "/Users/alisdair/Desktop/repro/30042/dummy.new"
      + type                = "zip"
    }

  # local_file.default will be created
  + resource "local_file" "default" {
      + content              = <<-EOT
            hello
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/Users/alisdair/Desktop/repro/30042/dummy.new"
      + id                   = (known after apply)
    }

  # null_resource.default will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
local_file.default: Creating...
local_file.default: Creation complete after 0s [id=f572d396fae9206628714fb2ce00f72e94f2258f]
data.archive_file.default: Reading...
data.archive_file.default: Read complete after 0s [id=9fe9b36abb7ab54f622478aeb66edbe9a19d82ef]
null_resource.default: Creating...
null_resource.default: Creation complete after 0s [id=5891673584615601693]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

Given this explanation, I don't think there's a bug in Terraform here, so I'm going to close this out. If there's a real-world example that this config is derived from where this suggestion doesn't solve the problem, please respond with some details and I'll look into that. Thanks again for the report!